/* FTP error code message */
"\n\nFTP error code: %@" = "\n\nCódigo de error de FTP: %@";

/* Error with FTP access to server */
"Access to the FTP server denied.  Please check your credentials." = "Se ha denegado el acceso al servidor FTP.  Comprueba tus credenciales.";

/* test connection failed */
"Connection Failed" = "Conexión fallida";

/* test connection worked */
"Connection Successful" = "Conexión correcta";

/* error message shown in properties dialog status when testing connections */
"Connection failed. Please verify your settings." = "Configuración fallida. Verifica la configuración.";

/* error message shown in properties dialog status when testing connections */
"Directory does not exist." = "El directorio no existe.";

/* Error with FTP server not initialized */
"Error initializing Server" = "Error al inicializar el servidor";

/* Inform user that there was an error with FTP and we don't know what it is */
"Error uploading with FTP" = "Error al cargar con el FTP";

/* Error with FTP writing data */
"Error while writing data." = "Error al escribir los datos.";

/* plugin name */
"FTP" = "FTP";

/* General Error with FTP */
"Failed to write file. Server returned an error, which could be caused by invalid credentials or an invalid directory.  Make sure you aren't creating nested directories." = "Error al escribir el archivo. El servidor devolvió un error, que podría ser causado por credenciales no válidas o un directorio no válido.  Asegúrate de que no estás creando directorios anidados.";

/* Error with FTP password */
"Please enter a password. Go to Preferences > Share > FTP to configure." = "Escribe una contraseña. Ve a Preferencias > Compartir > FTP para realizar la configuración.";

/* Error with FTP username */
"Please enter a username. Go to Preferences > Share > FTP to configure." = "Introduce un nombre de usuario. Ve a Preferencias > Compartir > FTP para realizar la configuración.";

/* Error with FTP destination */
"Please enter a valid destination. Go to Preferences > Share > FTP to configure." = "Introduce un destino válido. Ve a Preferencias > Compartir > FTP para realizar la configuración.";

/* plugin button tooltip */
"Send the capture to an FTP server using file transfer protocol." = "Envía una captura una a un servidor FTP usando el protocolo de transferencia de archivos.";

/* Error with FTP port */
"Server port invalid. Go to Preferences > Share > FTP to configure." = "El puerto del servidor no es válido. Ve a Preferencias > Compartir > FTP para realizar la configuración.";

/* Name of the service that gets stored in the password manager */
"TechSmith FTP Output" = "Salida de FTP de TechSmith";

/* Error with FTP destination not reachable */
"The FTP destination could not be reached." = "No se ha podido establecer contacto con el FTP de destino.";

/* Error with FTP write stream */
"There was an error creating the write stream." = "Se ha producido un error al crear la secuencia de escritura.";

/* Error with FTP reading file */
"There was an error reading the file." = "Se ha producido un error al leer el activo.";

/* Inform user that upload worked */
"Upload Successful" = "Cargar correcta";

/* Inform user that capture failed and wasn't shared */
"Your capture was not shared." = "Tu captura no se ha compartido.";

/* No comment provided by engineer. */
"[date]" = "[fecha]";

/* No comment provided by engineer. */
"[filehash]" = "[hash del archivo]";

/* No comment provided by engineer. */
"[filename]" = "[nombre de archivo]";

